app/controllers/invoice_trails_controller.rb

  def index
    @search = InvoiceTrail.search(params[:search])
    @invoice_trails, @invoice_trails_count = @search.all.paginate(:per_page => 10, :page => params[:page]), @search.count
---
SELECT * FROM "invoice_trails" WHERE ((invoice_trails.invoice_number = 123) AND (invoice_trails.full_name LIKE '%LA FERLA GIUSEPPINA%')) ORDER BY invoice_trails.gross_amount ASC
SELECT sum("invoice_trails".payed_amount) AS sum_payed_amount FROM "invoice_trails" WHERE ((invoice_trails.invoice_number = 123) AND (invoice_trails.admission_code = '23'))
SELECT count(*) AS count_all FROM "invoice_trails" WHERE ((invoice_trails.invoice_number = 123) AND (invoice_trails.full_name LIKE '%LA FERLA GIUSEPPINA%'))

  def show
    @invoice_trail = InvoiceTrail.find(params[:id])
---
SELECT * FROM "invoice_trails" WHERE ("invoice_trails"."id" = 1)

  def create
    @invoice_trail = InvoiceTrail.new(params[:invoice_trail])
    if @invoice_trail.save
---
INSERT INTO "invoice_trails" ("payed", "external_code", "discount", "updated_at", "admission_date", "invoice_number", "notes", "payment_date", "first_name", "gross_amount", "last_name", "payed_amount", "created_at") VALUES('f', '12-903', 0.0, '2009-09-07 15:45:19', '2009-09-07', NULL, '', NULL, 'Michelangelo', 12.0, 'Altamore', 0.0, '2009-09-07 15:45:19')

  def edit
    @invoice_trail = InvoiceTrail.find(params[:id])
---
SELECT * FROM "invoice_trails" WHERE ("invoice_trails"."id" = 1)

  def update
    @invoice_trail = InvoiceTrail.find(params[:id])
    if @invoice_trail.update_attributes(params[:invoice_trail])
---
SELECT * FROM "invoice_trails" WHERE ("invoice_trails"."id" = 1)
UPDATE "invoice_trails" SET "payed" = 't', "payed_amount" = 12.0, "invoice_number" = 12, "updated_at" = '2009-09-07 16:59:47' WHERE "id" = 3

  def destroy
    @invoice_trail = InvoiceTrail.find(params[:id])
    @invoice_trail.destroy
---
SELECT * FROM "invoice_trails" WHERE ("invoice_trails"."id" = 782)
DELETE FROM "invoice_trails" WHERE "id" = 782